Revit 2027 API
ExternalGeometryId Methods
The ExternalGeometryId type exposes the following members.
Methods
Name | Description
Dispose
Equals |  Determines whether the specified Object is equal to the current Object.
(Overrides Object.Equals(Object))
GetHashCode |  Gets the hash code.
(Overrides Object.GetHashCode())
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValidExternalGeometryId |  Checks whether a given string represents a valid ExternalGeometryId or not.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ExternalGeometryId Class
Autodesk.Revit.DB Namespace